gettobyte/GB_AutoBoardV1_MCAL_Codes/Peripherals/CAN/G2B_CAN_S32K344/src/Example2_Rx_CAN_HSE.c
};


const hseKeyGroupCfgEntry_t RAM_Catalog [] =
{
        /*  keyType                   numOfKeySlots maxKeyBitLen*/                                        \
        /* Symetric key */                                                                                \
        {HSE_ALL_MU_MASK, HSE_KEY_OWNER_ANY, HSE_KEY_TYPE_SHE, 1U, HSE_KEY128_BITS}, /* KEY_RAM */        \
            {HSE_ALL_MU_MASK, HSE_KEY_OWNER_ANY, HSE_KEY_TYPE_AES, 10U, HSE_KEY128_BITS},                 \
            {HSE_MU0_MASK, HSE_KEY_OWNER_ANY, HSE_KEY_TYPE_AES, 10U, HSE_KEY256_BITS},     /* HMAC key */ \
            {HSE_ALL_MU_MASK, HSE_KEY_OWNER_ANY, HSE_KEY_TYPE_HMAC, 6U, HSE_KEY1024_BITS}, /* RSA key */  \
            {HSE_ALL_MU_MASK, HSE_KEY_OWNER_ANY, HSE_KEY_TYPE_RSA_PUB, 2U, HSE_KEY2048_BITS},             \
            {HSE_ALL_MU_MASK, HSE_KEY_OWNER_ANY, HSE_KEY_TYPE_RSA_PUB_EXT, 1U, HSE_KEY1024_BITS},         \
            {HSE_ALL_MU_MASK, HSE_KEY_OWNER_ANY, WRP_KEY_TYPE_ECC_PAIR, 2U, WRP_ECC_KEY_SIZE},            \
            {HSE_ALL_MU_MASK, HSE_KEY_OWNER_ANY, WRP_KEY_TYPE_ECC_PUB, 5U, WRP_ECC_KEY_SIZE},             \
            {HSE_ALL_MU_MASK, HSE_KEY_OWNER_ANY, HSE_KEY_TYPE_SHARED_SECRET, 2U, HSE_KEY638_BITS},        \
            {HSE_ALL_MU_MASK, HSE_KEY_OWNER_ANY, HSE_KEY_TYPE_SHARED_SECRET, 1U, HSE_KEY2048_BITS},       \
        {                                                                                                 \
                0U, 0U, 0U, 0U, 0U                                                                        \
        }
};

/*==================================================================================================
*                                      GLOBAL VARIABLES
==================================================================================================*/

#ifdef HSE_SPT_KDF_SP800_108
  hseKeyInfo_t KdfSP800_108_SECRET_KEY_INFO_1_0 =
{
    .keyType = HSE_KEY_TYPE_AES,
    .keyBitLen = 128UL,
    .keyFlags = (HSE_KF_USAGE_DERIVE | HSE_KF_ACCESS_EXPORTABLE)
};

hseKey_t KdfSP800_108_SECRET_KEY_1_0 = {
    .keyHandle = HSE_INVALID_KEY_HANDLE,
    .pKeyInfo = &KdfSP800_108_SECRET_KEY_INFO_1_0,
    .keyValue = {
        .pKey2 = (uint8_t *)KdfSP800_108_SrcKey_1_0,
        .keyLen2 = ARRAY_SIZE(KdfSP800_108_SrcKey_1_0),
    },
};

hseKeyImportParams_t KdfSP800_108_ImportSecret_1_0 =
{
    .pKey = &KdfSP800_108_SECRET_KEY_1_0
};

/* kdf */
hseKdfSP800_108Scheme_t KdfSP800_108_Scheme_1_0 =
{
    .mode = HSE_KDF_SP800_108_COUNTER,
    .counterByteLength = HSE_KDF_SP800_108_COUNTER_LEN_DEFAULT,
    .kdfCommon = {
        .srcKeyHandle = HSE_INVALID_KEY_HANDLE,
        .targetKeyHandle = HSE_INVALID_KEY_HANDLE,
        .keyMatLen = BITS_TO_BYTES(512UL),
        .kdfPrf = HSE_KDF_PRF_CMAC,
        .pInfo = (HOST_ADDR)KdfSP800_108_FixedInfo_1_0,
        .infoLength = ARRAY_SIZE(KdfSP800_108_FixedInfo_1_0)
    }
};

#endif
/*==================================================================================================
*                                     FUNCTION PROTOTYPES
==================================================================================================*/
hseSrvResponse_t KdfSP800_108ReqTest_demo();
static hseSrvResponse_t KdfSP800_108Test_0(hseKeyImportParams_t *pImportSecretParams, hseKdfSP800_108Scheme_t *pKdfScheme);

uint8_t ECC_Public_key[64];

const uint8_t CMAC_Plaintext[] =
{ 0x6b, 0xc1, 0xbe, 0xe2, 0x2e, 0x40, 0x9f, 0x96, 0xe9, 0x3d, 0x7e, 0x11, 0x73,
        0x93, 0x17, 0x2a
};

uint8_t CMAC_Tag_OutPut[512] = {0};
uint32_t CMAC_Tag_length = 16;

uint8_t Fast_CMAC_Tag_OutPut[512] = {0};
uint8_t Fast_CMAC_Tag_length = 16;

Flexcan_Ip_MsgBuffType rxData;

uint8_t keyBuf[2 * BITS_TO_BYTES(HSE_MAX_ECC_KEY_BITS_LEN)] = {0};//132
uint16_t keyBufLen = sizeof(keyBuf);//132

hseKdfSP800_108Scheme_t key_Derive_info;
hseKeyHandle_t targetSharedSecretKey_1 = HSE_INVALID_KEY_HANDLE;




uint8_t aes_exported[64];
uint16_t aes_exported_len;

uint8_t *ScaledImage = 0;

#define SRC_WIDTH  8
#define SRC_HEIGHT 8
#define DEST_WIDTH 120
#define DEST_HEIGHT 120
#define SCALE_FACTOR 15  // 120/8

// Function to scale 8x8 image to 56*56
void scaleImage(uint8_t *src, uint8_t *dest) {
    for (int y = 0; y < SRC_HEIGHT; y++) {
        for (int x = 0; x < SRC_WIDTH; x++) {
            uint8_t pixel = src[y * SRC_WIDTH + x];  // Get original pixel

            // Expand this pixel into SCALE_FACTOR x SCALE_FACTOR block
            for (int dy = 0; dy < SCALE_FACTOR; dy++) {
                for (int dx = 0; dx < SCALE_FACTOR; dx++) {
                    int destX = x * SCALE_FACTOR + dx;
                    int destY = y * SCALE_FACTOR + dy;
                    dest[destY * DEST_WIDTH + destX] = pixel;
                }
            }
        }
    }
}



int main(void)
{

	Flexcan_Ip_StatusType FlexCAN_Api_Status;
	    /* Write your code here */
	    Clock_Ip_Init(&Mcu_aClockConfigPB[0]);

	    IntCtrl_Ip_EnableIrq(FlexCAN4_1_IRQn);
	    IntCtrl_Ip_InstallHandler(FlexCAN4_1_IRQn, CAN4_ORED_0_31_MB_IRQHandler, NULL_PTR);


	    /* Initialize all pins using the Port driver */
	    Port_Init(NULL_PTR);

	    FlexCAN_Ip_Init(INST_FLEXCAN_4, &FlexCAN_State0, &FlexCAN_Config0);

	    FlexCAN_Api_Status = FlexCAN_Ip_SetStartMode(INST_FLEXCAN_4);


	    Lpspi_Ip_Init(&Lpspi_Ip_PhyUnitConfig_SpiPhyUnit_0_Instance_3);
	  	GB_ST7789_Init();

	  	TestDelay(700000);
	  	ST7789_SetAddressWindow(ST7789_XStart,ST7789_YStart, ST7789_XEnd, ST7789_YEnd);
	  	ST7789_Fill_Color(ST77XX_BLACK);
	  	TestDelay(700000);


	    ST7789_WriteString(0, 80, "VCU ECU: Slave Node", Font_16x26, ST77XX_NEON_GREEN, ST77XX_BLACK);


	/*Check Fw Install Status*/
	WaitForHSEFWInitToFinish();
	hseSrvResponse_t HseResponse;
	//Format the key catalog
	HseResponse = FormatKeyCatalogs(NVM_Catalog, RAM_Catalog);
	ASSERT(HSE_SRV_RSP_OK == HseResponse);

	HseResponse = HKF_Init(NVM_Catalog, RAM_Catalog);
	ASSERT(HSE_SRV_RSP_OK == HseResponse);


	//For Session Keys example
    hseKeyHandle_t eccRAMKeyHandle = HSE_DEMO_RAM_ECC_PAIR_KEY_HANDLE;
	//hseKeyHandle_t eccRAMKeyHandle = HSE_DEMO_RAM_ECC_PUB_KEY_HANDLE;
    hseKeyHandle_t DHSharedSecretRAMKeyHandle = HSE_DEMO_DH_SHARED_SECRET_HANDLE;
   // hseKeyHandle_t AESDerivedKeyInfoHandle1 = HSE_DEMO_RAM_AES256_KEY1;
    hseKeyHandle_t AESDerivedKeyInfoHandle1 = HSE_DEMO_NVM_AES256_KEY2;

    ST7789_WriteString(10, 130, "Exchanging keys for secure communication(via ECDH)....", Font_11x18, ST77XX_NEON_GREEN, ST77XX_BLACK);



    /********* Key Exchange protocol ECDH for Shared Secret Key */
    // Key Exchange via ECDH protocol
    //generate the ecc private - public key and export the public key to application
    HseResponse = GenerateEccKeyAndExportPublic( eccRAMKeyHandle, HSE_EC_SEC_SECP256R1, HSE_KF_USAGE_EXCHANGE, ECC_Public_key);
    ASSERT(HSE_SRV_RSP_OK == HseResponse);

    // transmit the exported public key to the other node via can and also receive the exported public key of other node and use that in next step to import it in public key handle

    ST7789_WriteString(0, 190, "Slave Node Receiving Public keys for computing shared key.....", Font_11x18, ST77XX_NEON_GREEN, ST77XX_BLACK);

    FlexCAN_Api_Status = FlexCAN_Ip_ConfigRxMb(INST_FLEXCAN_4, RX_MB_IDX, &rx_info_polling_std, ECDH_Tx_Pub_Key_MSG_ID);
    while(FLEXCAN_STATUS_TIMEOUT == FlexCAN_Ip_ReceiveBlocking(INST_FLEXCAN_4, RX_MB_IDX, &rxData, true,1000));

    scaleImage(rxData.data, ScaledImage);

	ST7789_SetAddressWindow(ST7789_XStart,ST7789_YStart, ST7789_XEnd, ST7789_YEnd);
	ST7789_DrawImage(30,250, 120, 120, ScaledImage);

