gettobyte/GB_AutoBoardV1_MCAL_Codes/Peripherals/CAN/G2B_CAN_S32K344/src/Example2_Rx_CAN_HSE.c
//    string1 = uint8_to_stringhex(rxData.data, rxData.dataLen );
//	ST7789_WriteString(0, 160, string1 , Font_7x10, ST77XX_NEON_GREEN, ST77XX_BLACK);



    ST7789_WriteString(0, 170, "Transmit Public Key of Slave for Key exchange protocol", Font_16x26, ST77XX_NEON_GREEN, ST77XX_BLACK);

	string1 = uint8_to_stringhex(ECC_Public_key, 64);
	ST7789_WriteString(0, 200, string1 , Font_16x26, ST77XX_NEON_GREEN, ST77XX_BLACK);
    FlexCAN_Api_Status = FlexCAN_Ip_Send(INST_FLEXCAN_4, RX_MB_IDX, &rx_info_inter_canfd, ECDH_Rx_Pub_Key_MSG_ID, (uint8 *)&ECC_Public_key);
	TestDelay(2000000);


    /* Import ECC Key */
    // import the received public key from other node to the ecc key pair handle
    HseResponse = ImportEccKeyReq(HSE_DEMO_RAM_ECC_PUB_KEY_HANDLE, HSE_KEY_TYPE_ECC_PUB,HSE_KF_USAGE_EXCHANGE, HSE_EC_SEC_SECP256R1, KeyBitLen(rxData.dataLen), rxData.data, NULL);
    ASSERT(HSE_SRV_RSP_OK == HseResponse);

    // now compute the shared secret from the public( having new public key from other node) and private key handles
    /* Compute DH Shared Secret (ECDH) */
    HseResponse = DHSharedSecretCompute(HSE_DEMO_RAM_ECC_PUB_KEY_HANDLE,HSE_DEMO_RAM_ECC_PAIR_KEY_HANDLE,&DHSharedSecretRAMKeyHandle,RAM_KEY,KeyBitLen(HSE_EC_SEC_SECP256R1));
    ASSERT(HSE_SRV_RSP_OK == HseResponse);




  /***** Derive Key using SP800_108 KDF for AES Key*********/


    HKF_AllocKeySlot(RAM_KEY, HSE_KEY_TYPE_SHARED_SECRET, KdfSP800_108_Scheme_1_0.kdfCommon.keyMatLen * 8U, &targetSharedSecretKey_1);

       KdfSP800_108_Scheme_1_0.kdfCommon.srcKeyHandle = DHSharedSecretRAMKeyHandle ;
       KdfSP800_108_Scheme_1_0.kdfCommon.targetKeyHandle = targetSharedSecretKey_1;


       HseResponse =  HSEKdfSP800_108Req(&KdfSP800_108_Scheme_1_0);



    //HSEKdfSP800
    HseResponse = KdfSP800_108ReqTest_demo();

    //Declare the information about the 256 bits AES key to be extracted
    hseKeyInfo_t aes256KeyInfo = {
        .keyType = HSE_KEY_TYPE_AES,                             //Will generate an AES key
        .keyFlags = (HSE_KF_USAGE_ENCRYPT |HSE_KF_USAGE_DECRYPT| //Usage flags for this key - Encrypt/Decrypt/Sign/Verify - AEAD
            HSE_KF_USAGE_SIGN|HSE_KF_USAGE_VERIFY),
        .keyBitLen = 256U,                                       //256 bits key
    };

    //Extract the 256 bits AES key from the remaining derived key material
    HseResponse = HSEKeyDeriveExtractKeyReq
            (
                   KdfSP800_108_Scheme_1_0.kdfCommon.targetKeyHandle,
            	//	DHSharedSecretRAMKeyHandle,
            		BITS_TO_BYTES(aes256KeyInfo.keyBitLen),
                    &AESDerivedKeyInfoHandle1,
					NVM_KEY,
					// RAM_KEY,
                    aes256KeyInfo
            );
    ASSERT(HSE_SRV_RSP_OK == HseResponse);


    HseResponse = ExportPlainSymKeyReq(AESDerivedKeyInfoHandle1,&aes256KeyInfo, aes_exported, &aes_exported_len  );



    /****** MAC Generation and Verification ****************/

    //CMAC Generation using CMAC_Plaintext and AESDerivedKeyInfoHandle1 key handle( which is derived from KDF function).
    hseMacScheme_t macScheme;
    macScheme.macAlgo = HSE_MAC_ALGO_CMAC;
    macScheme.sch.cmac.cipherAlgo = HSE_CIPHER_ALGO_AES;
    HseResponse = AesCmacGenerate(AESDerivedKeyInfoHandle1, NUM_OF_ELEMS(CMAC_Plaintext), CMAC_Plaintext, &CMAC_Tag_length,  CMAC_Tag_OutPut, HSE_SGT_OPTION_NONE );
  		  //MacSignSrv(HSE_ACCESS_MODE_ONE_PASS, 0, macScheme, AESDerivedKeyInfoHandle1, NUM_OF_ELEMS(CMAC_Plaintext), CMAC_Plaintext, &CMAC_Tag_length,  CMAC_Tag_OutPut, HSE_SGT_OPTION_NONE );

    // Master will transmit the CMAC_PlainText & CMAC_Tag_OutPut to receiver and also AES Derived Key value to receiver.
    // Receiver will received the derived key handle and will import that into it for AES key handle in NVM.


   HseResponse = AesCmacVerify(AESDerivedKeyInfoHandle1, NUM_OF_ELEMS(CMAC_Plaintext), CMAC_Plaintext, &CMAC_Tag_length,  CMAC_Tag_OutPut, HSE_SGT_OPTION_NONE );


   /********* CMAC With Counter Demo Code ********************/

   uint32_t volatileCnt       = 0xFFFFFFFFUL;

    uint32_t rpBitSize          = 40UL;
    uint32_t TxnodecntIdx       = HSE_NUM_OF_MONOTONIC_COUNTERS - 3UL;
    uint32_t RxnodecntIdx       = HSE_NUM_OF_MONOTONIC_COUNTERS - 2UL;

    HseResponse =  MonotonicCnt_Config(TxnodecntIdx,rpBitSize);
    ASSERT(HSE_SRV_RSP_OK == HseResponse);

    /* Configure Node B */
    HseResponse = MonotonicCnt_Config(RxnodecntIdx, rpBitSize);
    ASSERT(HSE_SRV_RSP_OK == HseResponse);


    /* Configure Node A Counter as a default value */
    HseResponse = MonotonicCnt_Increment(TxnodecntIdx, 0x800000UL);
      ASSERT(HSE_SRV_RSP_OK == HseResponse);

      /* Configure Node B Counter as a default value */
      HseResponse = MonotonicCnt_Increment(RxnodecntIdx, 0x800000UL);
      ASSERT(HSE_SRV_RSP_OK == HseResponse);


    HseResponse = CmacWithCounter(AESDerivedKeyInfoHandle1, HSE_AUTH_DIR_GENERATE,TxnodecntIdx, 0,
    		NUM_OF_ELEMS(CMAC_Plaintext)*8U, CMAC_Plaintext, (16*8), CMAC_Tag_OutPut, &volatileCnt, HSE_SGT_OPTION_NONE);


    HseResponse = CmacWithCounter(AESDerivedKeyInfoHandle1, HSE_AUTH_DIR_VERIFY,RxnodecntIdx, 0,
    		NUM_OF_ELEMS(CMAC_Plaintext)*8U, CMAC_Plaintext, (16*8), CMAC_Tag_OutPut, &volatileCnt, HSE_SGT_OPTION_NONE);






    /***************Fast CMAC ***************************/

    HseResponse = AesFastCmacGenerate(AESDerivedKeyInfoHandle1, NUM_OF_ELEMS(CMAC_Plaintext)*8, CMAC_Plaintext, Fast_CMAC_Tag_length*8, Fast_CMAC_Tag_OutPut);
    ASSERT(HSE_SRV_RSP_OK == HseResponse);


    //Sender will send, plaintext, aesderivekey info and
    HseResponse = AesFastCmacVerify(AESDerivedKeyInfoHandle1, NUM_OF_ELEMS(CMAC_Plaintext)*8, CMAC_Plaintext, Fast_CMAC_Tag_length*8, Fast_CMAC_Tag_OutPut);
    ASSERT(HSE_SRV_RSP_OK == HseResponse);



    uint8_t ciphermsg[NUM_OF_ELEMS(demoapp_msg)] = {0U};



    /* Finished session keys related example */
    for (;;) {

    }

    return 0;
}


hseKeyHandle_t srcKey_0 = HSE_INVALID_KEY_HANDLE;
hseKeyHandle_t targetSharedSecretKey_0 = HSE_INVALID_KEY_HANDLE;

hseSrvResponse_t KdfSP800_108ReqTest_demo()
{
    hseSrvResponse_t hseResponse;

    HKF_AllocKeySlot(RAM_KEY, KdfSP800_108_ImportSecret_1_0.pKey->pKeyInfo->keyType,
                     KdfSP800_108_ImportSecret_1_0.pKey->pKeyInfo->keyBitLen, &srcKey_0);

    HKF_AllocKeySlot(RAM_KEY, HSE_KEY_TYPE_SHARED_SECRET, KdfSP800_108_Scheme_1_0.kdfCommon.keyMatLen * 8U, &targetSharedSecretKey_0);

    KdfSP800_108_ImportSecret_1_0.pKey->keyHandle = srcKey_0;
    KdfSP800_108_Scheme_1_0.kdfCommon.srcKeyHandle = srcKey_0;
    KdfSP800_108_Scheme_1_0.kdfCommon.targetKeyHandle = targetSharedSecretKey_0;
    hseResponse = KdfSP800_108Test_0(&KdfSP800_108_ImportSecret_1_0, &KdfSP800_108_Scheme_1_0);
    goto exit;
    exit:
    return hseResponse;
}


static hseSrvResponse_t KdfSP800_108Test_0
(hseKeyImportParams_t *pImportSecretParams, hseKdfSP800_108Scheme_t *pKdfScheme)
{
    hseSrvResponse_t hseResponse;

    pImportSecretParams->authParams.pKeyHandle = NULL;
    pImportSecretParams->cipherParams.pKeyHandle = NULL;
    hseResponse = ImportKeyReq(pImportSecretParams);
    if(HSE_SRV_RSP_OK != hseResponse)
    {
        goto exit;
    }

    hseResponse = HSEKdfSP800_108Req(pKdfScheme);
    if(HSE_SRV_RSP_OK != hseResponse)
    {
        goto exit;
    }
    exit:
    return hseResponse;
}
